kb1c/src/Catalogs/СтатьиБазыЗнаний/СтатьиБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиБазыЗнаний</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоложениеСодержания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Содержание</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Уровень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСворачивание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Картинки</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Граница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Таблицы</name>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выравнивание</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбтеканиеТекста</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаСтилейHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстТаблицыHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Категории</name>
    <attributes>
      <name>Категория</name>
      <type>
        <types>CatalogRef.КатегорииБазыЗнаний</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сноски</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаТип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаАдрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаОткрывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГиперссылкаПодсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГиперссылки</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Открывать</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

kb1c/src/InformationRegisters/ИсторияСтатейБазыЗнаний/ИсторияСтатейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияСтатейБазыЗнаний</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Изменено</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.ПользователиБазыЗнаний</types>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяБазыЗнаний</name>
    <type>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/InformationRegisters/ХранилищеДанныхБазыЗнаний/ХранилищеДанныхБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ХранилищеДанныхБазыЗнаний</name>
  <resources>
    <name>ХранилищеЗначения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ВидДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>СтатьяБазыЗнаний</name>
    <type>
      <types>CatalogRef.СтатьиБазыЗнаний</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Область</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

kb1c/src/Enums/ВидыНовостейБазыЗнаний/ВидыНовостейБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНовостейБазыЗнаний</name>
  <enumValues>
    <name>Создание</name>
  </enumValues>
  <enumValues>
    <name>Изменение</name>
  </enumValues>
  <enumValues>
    <name>Удаление</name>
  </enumValues>
  <enumValues>
    <name>Оповещение</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

kb1c/src/Catalogs/КатегорииБазыЗнаний/КатегорииБазыЗнаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииБазыЗнаний</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

kb1c/src/Catalogs/СтатьиБазыЗнаний/ObjectModule.bsl
Перем ОсвободитьСтатью Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ МЕТОДЫ

Процедура РекурсивныйОбходСодержанияПоДаннымРодителя(ТаблицаДанных, ЗначениеРодитель, НомерУровня)
	МассивСтрок = ТаблицаДанных.НайтиСтроки(Новый Структура("Родитель", ЗначениеРодитель));
	Для Каждого СтрокаТаблицы Из МассивСтрок Цикл
		СтрокаТаблицы.Уровень = НомерУровня + 1;
		РекурсивныйОбходСодержанияПоДаннымРодителя(ТаблицаДанных, СтрокаТаблицы.Область, СтрокаТаблицы.Уровень);
	КонецЦикла;
КонецПроцедуры

Процедура ОбновитьДанныеУровнейСодержания() Экспорт
	
	ТаблицаСодержание = ЭтотОбъект.Содержание.Выгрузить();
	ТаблицаСодержание.Индексы.Добавить("Родитель");
	
	РекурсивныйОбходСодержанияПоДаннымРодителя(ТаблицаСодержание, "", 0);
	
	ЭтотОбъект.Содержание.Загрузить(ТаблицаСодержание);
	
КонецПроцедуры

Функция ИерархияСодержанияИзменилась()
	
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		Если ЭтотОбъект.Содержание.Количество() > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиБазыЗнанийСодержание.НомерСтроки,
		|	СтатьиБазыЗнанийСодержание.Область,
		|	СтатьиБазыЗнанийСодержание.Родитель
		|ИЗ
		|	Справочник.СтатьиБазыЗнаний.Содержание КАК СтатьиБазыЗнанийСодержание
		|ГДЕ
		|	СтатьиБазыЗнанийСодержание.Ссылка = &Ссылка";
		Результат = Запрос.Выполнить().Выгрузить();
		
		КоличествоСтрок = Результат.Количество();
		Если КоличествоСтрок <> ЭтотОбъект.Содержание.Количество() Тогда
			Возврат Истина;
		Иначе 
			Для Индекс = 0 По КоличествоСтрок - 1 Цикл
				СтрокаРезультат = Результат[Индекс];
				СтрокаОбъект	= ЭтотОбъект.Содержание[Индекс];
				
				Если СтрокаРезультат.Область <> СтрокаОбъект.Область
					ИЛИ СтрокаРезультат.Родитель <> СтрокаОбъект.Родитель Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьКатегорииДляОбновленияСтатистики()
	
	МассивКатегорий = ЭтотОбъект.Категории.ВыгрузитьКолонку("Категория");
	
	Если ЭтотОбъект.Ссылка.Пустая() Тогда
		Возврат МассивКатегорий;
	Иначе
		ПометкаУдаленияИзменилась = (ЭтотОбъект.ПометкаУдаления <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Ссылка, "ПометкаУдаления"));
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Категории", МассивКатегорий);
		Запрос.УстановитьПараметр("ПометкаУдаленияИзменилась", ПометкаУдаленияИзменилась);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиБазыЗнанийКатегории.Категория КАК Категория
		|ПОМЕСТИТЬ КатегорииПоСтатье
		|ИЗ
		|	Справочник.СтатьиБазыЗнаний.Категории КАК СтатьиБазыЗнанийКатегории
		|ГДЕ
		|	СтатьиБазыЗнанийКатегории.Ссылка = &Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Категория
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КатегорииБазыЗнаний.Ссылка КАК Категория
		|ИЗ
		|	Справочник.КатегорииБазыЗнаний КАК КатегорииБазыЗнаний
		|		ЛЕВОЕ СОЕДИНЕНИЕ КатегорииПоСтатье КАК КатегорииПоСтатье
		|		ПО КатегорииБазыЗнаний.Ссылка = КатегорииПоСтатье.Категория
		|ГДЕ
		|	КатегорииБазыЗнаний.Ссылка В(&Категории)
		|	И (КатегорииПоСтатье.Категория ЕСТЬ NULL 
		|			ИЛИ &ПометкаУдаленияИзменилась)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КатегорииПоСтатье.Категория
		|ИЗ
		|	КатегорииПоСтатье КАК КатегорииПоСтатье
		|ГДЕ
		|	НЕ КатегорииПоСтатье.Категория В (&Категории)";
		МассивКатегорий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Категория");
	КонецЕсли;
	
	Возврат МассивКатегорий;
	
КонецФункции

Функция ПолучитьПолныйТекстСтатьи()
	
	Значение = ЭтотОбъект.Текст;
	
	Для Каждого СтрокаСодержания Из ЭтотОбъект.Содержание Цикл
		Значение = Значение + "
		|
		|Подраздел: " + СтрокаСодержания.Наименование + "
		|" + СтрокаСодержания.Текст;
	КонецЦикла;
	
	Возврат Значение;
	
КонецФункции

Функция ЗначениеДопСвойства(Имя, ПоУмолчанию)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство(Имя) Тогда
		Возврат ЭтотОбъект.ДополнительныеСвойства[Имя];
	Иначе 
		Возврат ПоУмолчанию;
	КонецЕсли;
	
КонецФункции

// ТипНовости: 1 - создание, 2 - изменение, 3 - удаление
Функция ДобавитьНовостьБазыЗнаний(ТипНовости)
	
	ПараметрыСсылкиОтв	= Новый Структура("id", Строка(ЭтотОбъект.Ответственный.УникальныйИдентификатор()));
	АдресСсылкиОтв		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("user", ПараметрыСсылкиОтв);
	
	ПараметрыСсылкиСтат	= Новый Структура("id", Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	АдресСсылкиСтат		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("article", ПараметрыСсылкиСтат);
	
	Если ТипНовости = 1 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Создание;
		Заголовок	= "Новая статья '%3'";
		ТекстHTML	= "<div>%1 в %2 добавлена новая статья базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Автор: <a href='" + АдресСсылкиОтв + "'>%4</a>
		|	<br>Категории: %5
		|	<br><a href='" + АдресСсылкиСтат + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 2 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Изменение;
		Заголовок	= "Изменена статья '%3'";
		ТекстHTML	= "<div>%1 в %2 пользователем <a href='" + АдресСсылкиОтв + "'>%4</a> изменена статья базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Категории: %5
		|	<br><a href='" + АдресСсылкиСтат + "'>Перейти</a>
		|</div>";
	ИначеЕсли ТипНовости = 2 Тогда
		ВидНовости	= Перечисления.ВидыНовостейБазыЗнаний.Удаление;
		Заголовок	= "Удалена статья '%3'";
		ТекстHTML	= "<div>%1 в %2 пользователем <a href='" + АдресСсылкиОтв + "'>%4</a> удалена статья базы знаний.
		|	<br>Заголовок: %3.
		|	<br>Категории: %5
		|</div>";
	КонецЕсли;
	
	ДатаНовости = ТекущаяДатаСеанса();
	
	ТекстКатегории = "";
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Категории Цикл
		ПараметрыСсылкиКат	= Новый Структура("id", Строка(СтрокаТаблицы.Категория.УникальныйИдентификатор()));
		АдресСсылкиКат		= БазаЗнанийAPIКлиентСервер.КонструкторСсылки_page("category", ПараметрыСсылкиКат);
		
		ТекстКатегории = ТекстКатегории + ?(ПустаяСтрока(ТекстКатегории), "", "; ") + 
			"<a href='" + АдресСсылкиКат + "'>" + Строка(СтрокаТаблицы.Категория) + "</a>";
	КонецЦикла;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДЛФ=DD"));
	МассивПараметров.Добавить(Формат(ДатаНовости, "ДФ=HH:mm"));
	МассивПараметров.Добавить(СокрЛП(ЭтотОбъект.Наименование));
	МассивПараметров.Добавить(Строка(ЭтотОбъект.Ответственный));
	МассивПараметров.Добавить(ТекстКатегории);
	
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(Заголовок, МассивПараметров);
	ТекстHTML = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтрокуИзМассива(ТекстHTML, МассивПараметров);
	
	ПараметрыНовости = Новый Структура;
	ПараметрыНовости.Вставить("Автор"				, ЭтотОбъект.Ответственный);
	ПараметрыНовости.Вставить("Заголовок"			, Заголовок);
	ПараметрыНовости.Вставить("ТекстHTML"			, ТекстHTML);
	ПараметрыНовости.Вставить("ОбъектБазыЗнаний"	, ЭтотОбъект.Ссылка);
	ПараметрыНовости.Вставить("Важность"			, 2);
	ПараметрыНовости.Вставить("ВидНовости"			, ВидНовости);
	
	БазаЗнанийВызовСервера.ДобавитьНовость(ПараметрыНовости);
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ФОРМИРОВАНИЕ ДВИЖЕНИЙ СПРАВОЧНИКА

Процедура ЗаписатьИсториюСтатьиБазыЗнаний()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ИсторияСтатейБазыЗнаний.НомерВерсии), 0) КАК НомерВерсии
	|ИЗ
	|	РегистрСведений.ИсторияСтатейБазыЗнаний КАК ИсторияСтатейБазыЗнаний
	|ГДЕ
	|	ИсторияСтатейБазыЗнаний.СтатьяБазыЗнаний = &Ссылка";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		НомерВерсии = 1;
	Иначе 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		НомерВерсии = Выборка.НомерВерсии + 1;
	КонецЕсли;
	
	ЗаписьРегистра = РегистрыСведений.ИсторияСтатейБазыЗнаний.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.СтатьяБазыЗнаний = ЭтотОбъект.Ссылка;
	ЗаписьРегистра.НомерВерсии		= НомерВерсии;
	ЗаписьРегистра.Текст			= ЭтотОбъект.ПолныйТекст;
	ЗаписьРегистра.Описание			= ЭтотОбъект.ОписаниеИзменений;
	ЗаписьРегистра.Ответственный	= Пользователи.ТекущийПользователь();
	ЗаписьРегистра.Изменено			= ТекущаяДатаСеанса();
	ЗаписьРегистра.Записать(Истина);
	
КонецПроцедуры

Процедура ПроверитьКартинкиПоСтатье()
	МассивУдаления = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Картинки Цикл
		СтрокаПоиска = "[picture='" + СтрокаТаблицы.Имя + "']";
		Если Найти(ЭтотОбъект.ПолныйТекст, СтрокаПоиска) = 0 Тогда
			МассивУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеУдаления = Новый Массив;
	
	Для Каждого СтрокаУдаления Из МассивУдаления Цикл
		СтруктураДанных = Новый Структура("Область, Идентификатор");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаУдаления);
		ДанныеУдаления.Добавить(СтруктураДанных);
		
		ЭтотОбъект.Картинки.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КартинкиУдалить", ДанныеУдаления);
КонецПроцедуры

Процедура ПроверитьТаблицыПоСтатье()
	МассивУдаления = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Таблицы Цикл
		СтрокаПоиска = "[table='" + СтрокаТаблицы.Имя + "']";
		Если Найти(ЭтотОбъект.ПолныйТекст, СтрокаПоиска) = 0 Тогда
			МассивУдаления.Добавить(СтрокаТаблицы);
		КонецЕсли;
	КонецЦикла;
	
	ДанныеУдаления = Новый Массив;
	
	Для Каждого СтрокаУдаления Из МассивУдаления Цикл
		СтруктураДанных = Новый Структура("Область, Идентификатор");
		ЗаполнитьЗначенияСвойств(СтруктураДанных, СтрокаУдаления);
		ДанныеУдаления.Добавить(СтруктураДанных);
		
		ЭтотОбъект.Таблицы.Удалить(СтрокаУдаления);
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТаблицыУдалить", ДанныеУдаления);
КонецПроцедуры

Процедура ПроверитьСноскиПоСтатье()
	МассивУдаления = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ЭтотОбъект.Сноски Цикл
		СтрокаПоиска = "href='ref:" + СтрокаТаблицы.Идентификатор + "'";
		Если Найти(ЭтотОбъект.ТекстHTML, СтрокаПоиска) = 0 Тогда
			ЕстьВПодразделах = Ложь;
			Для Каждого СтрокаСодержания Из ЭтотОбъект.Содержание Цикл
				Если Найти(СтрокаСодержания.ТекстHTML, СтрокаПоиска) > 0 Тогда
					ЕстьВПодразделах = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ ЕстьВПодразделах Тогда
				МассивУдаления.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаУдаления Из МассивУдаления Цикл
		ЭтотОбъект.Сноски.Удалить(СтрокаУдаления);
	КонецЦикла;
КонецПроцедуры

Процедура УдалитьДанныеХранилищаБазыЗнаний()
	
	// Удалим картинки
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("КартинкиУдалить")
		И ТипЗнч(ЭтотОбъект.ДополнительныеСвойства.КартинкиУдалить) = Тип("Массив") Тогда
		
		Для Каждого СтруктураДанных Из ЭтотОбъект.ДополнительныеСвойства.КартинкиУдалить Цикл
			МенеджерЗаписи = РегистрыСведений.ХранилищеДанныхБазыЗнаний.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтатьяБазыЗнаний = ЭтотОбъект.Ссылка;
			МенеджерЗаписи.Область			= СтруктураДанных.Область;
			МенеджерЗаписи.Идентификатор	= СтруктураДанных.Идентификатор;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	// Удалим таблицы
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицыУдалить")
		И ТипЗнч(ЭтотОбъект.ДополнительныеСвойства.ТаблицыУдалить) = Тип("Массив") Тогда
		
		Для Каждого СтруктураДанных Из ЭтотОбъект.ДополнительныеСвойства.ТаблицыУдалить Цикл
			МенеджерЗаписи = РегистрыСведений.ХранилищеДанныхБазыЗнаний.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.СтатьяБазыЗнаний = ЭтотОбъект.Ссылка;
			МенеджерЗаписи.Область			= СтруктураДанных.Область;
			МенеджерЗаписи.Идентификатор	= СтруктураДанных.Идентификатор;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Удалить();
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА СОБЫТИЙ МОДУЛЯ

Процедура ПередЗаписью(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Ответственный) Тогда
		ЭтотОбъект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ЭтотОбъект.ДатаСоздания = Дата(1, 1, 1) Тогда
		ЭтотОбъект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ИерархияСодержанияИзменилась() Тогда
		ОбновитьДанныеУровнейСодержания();
	КонецЕсли;
	
	ПолныйТекстИзм	= ПолучитьПолныйТекстСтатьи();
	ТекстСтатьиИзм	= (ПолныйТекстИзм <> ЭтотОбъект.ПолныйТекст);
	Если ТекстСтатьиИзм Тогда
		ЭтотОбъект.ПолныйТекст	= ПолныйТекстИзм;
	КонецЕсли;
	
	Если НЕ ЭтотОбъект.ЭтоНовый() Тогда
		ПроверитьКартинкиПоСтатье();
		ПроверитьТаблицыПоСтатье();
		ПроверитьСноскиПоСтатье();
	КонецЕсли;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТекстИзменился"		, ТекстСтатьиИзм);
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый"			, ЭтотОбъект.ЭтоНовый());
	ЭтотОбъект.ДополнительныеСвойства.Вставить("КатегорииОбновления", ПолучитьКатегорииДляОбновленияСтатистики());
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтотОбъект.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Освобождаем статью
	Если ОсвободитьСтатью Тогда
		Справочники.СтатьиБазыЗнаний.ЗавершитьРедактированиеСтатьи(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	ЭтоНовыйЭлемент			= ЗначениеДопСвойства("ЭтоНовый", Ложь);
	ТекстСтатьИзменился		= ЗначениеДопСвойства("ТекстИзменился", Ложь);
	КатегорииОбновления		= ЗначениеДопСвойства("КатегорииОбновления", Неопределено);
	
	ЗаписатьИзменениеСтатьи = ЭтоНовыйЭлемент;
	Если НЕ БазаЗнанийВызовСервера.СтатьяРедактируется(ЭтотОбъект.Ссылка) И ТекстСтатьИзменился Тогда
		ЗаписатьИсториюСтатьиБазыЗнаний();
		ЗаписатьИзменениеСтатьи = Истина;
	КонецЕсли;
	
	Если ЗаписатьИзменениеСтатьи Тогда
		БазаЗнаний.ЗарегистрироватьИзменениеСтатьи(ЭтотОбъект.Ссылка);
	КонецЕсли;
	
	Если ЭтоНовыйЭлемент ИЛИ ЗаписатьИзменениеСтатьи Тогда
		ТипНовости = ?(ЭтоНовыйЭлемент, 1, 2);
		ДобавитьНовостьБазыЗнаний(ТипНовости);
	КонецЕсли;
	
	Если ТипЗнч(КатегорииОбновления) = Тип("Массив") И КатегорииОбновления.Количество() > 0 Тогда
		МассивПараметров = Новый Массив;
		МассивПараметров.Добавить(Новый Структура("Категории", КатегорииОбновления));
		ФоновыеЗадания.Выполнить(
			"БазаЗнаний.ОбновитьСтатистикуКатегорий",
			МассивПараметров, ,
			"Обновление статистики по категориям статьи");
	КонецЕсли;
	
	УдалитьДанныеХранилищаБазыЗнаний();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтотОбъект.Ответственный		= Неопределено;
	ЭтотОбъект.ДатаСоздания 		= Дата(1, 1, 1);
	ЭтотОбъект.Черновик				= Истина;
	ЭтотОбъект.ОписаниеИзменений	= "";
	ЭтотОбъект.КраткоеОписание		= "";
	ЭтотОбъект.ПолныйТекст			= "";
	ЭтотОбъект.Текст				= "";
	ЭтотОбъект.ТекстHTML			= "";
	ЭтотОбъект.Содержание.Очистить();
	ЭтотОбъект.Картинки.Очистить();
	ЭтотОбъект.Таблицы.Очистить();
	ЭтотОбъект.Сноски.Очистить();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	ДобавитьНовостьБазыЗнаний(3);
КонецПроцедуры

ОсвободитьСтатью = Ложь;
